In [1]:
import numpy as np
import pandas as pd
import pandas_datareader.data as web
import sys
import csv
import json
from lxml import objectify
from io import StringIO
import requests
import sqlite3
import sqlalchemy as sqla
from numpy import nan as NA
import re

In [3]:
frame = pd.DataFrame({'a':[0,1,0,1], 'b':[4,7,-3,2]})
frame = frame.sort_values(by = ['a', 'b'])
frame

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [4]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'],columns=['d','a','b','c'])
frame = frame.sort_index(axis = 1)
frame

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [5]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
f_data = pd.Series(sdata, index = states)
f_data

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
obj = pd.Series([6,7,-5,3], index=['d','b','a','c'])
print(obj[obj>0])

d    6
b    7
c    3
dtype: int64

In [9]:
a = [1,2,3]
b = [4,5,6]

a.append(b)

None

In [12]:
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
data = data.dropna(axis = 1, how = 'all')
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Minimum number of argument we require to pass in pandas series ?
1.0

2.1

3.2

4.3

Show Answer
Answer: 2

In [15]:
obj = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])
obj = obj.reindex(range(6), method = 'ffill')
obj

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [20]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index = ['ohio', 'colorado', 'utah', 'new york'], 
                   columns = ['one','two', 'three', 'four'])
data[['three', 'one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

In [21]:
frame = pd.DataFrame({'a':[0,1,0,1], 'b':[4,7,-3,2]})
frame = frame.sort_values(by = 'b')
frame

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [24]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], columns=['d','a','b','c'])
frame = frame.sort_index()
frame

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [25]:
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
data = data.dropna(how = 'all')
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0